# ======================================================
# 1. استيراد المكتبات
# ======================================================

import pandas as pd

from sklearn.model_selection import train_test_split

from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import StandardScaler

from sklearn.svm import SVC

from sklearn.metrics import (
    confusion_matrix,
    classification_report
)
import matplotlib.pyplot as plt


# ======================================================
# 2. قراءة البيانات
# ======================================================

df = pd.read_csv("svt_dataset_10000.csv")


# ======================================================
# 3. فصل المدخلات والمخرجات
# ======================================================

X = df.drop(
    columns=[
       "svt"
    ]
)

y = df["svt"]


# ======================================================
# 4. تحويل النصوص إلى أرقام
# ======================================================

encoder = LabelEncoder()

X["gender"] = encoder.fit_transform(X["gender"])



scaler = StandardScaler()

X = scaler.fit_transform(X)

# ======================================================
# 5. تقسيم البيانات
# ======================================================

X_train, X_test, y_train, y_test = train_test_split(

    X,
    y,

    test_size=0.20,

    random_state=42

)


# ======================================================
# 6. إنشاء نموذج svm
# ======================================================

model = SVC(

    kernel="linear"

)


# ======================================================
# 7. تدريب النموذج
# ======================================================

model.fit(

    X_train,

    y_train

)


# ======================================================
# 8. التنبؤ
# ======================================================

prediction = model.predict(

    X_test

)


# ======================================================
# 9. حساب الدقة
# ======================================================

accuracy = model.score(

    X_test,

    y_test

)


# ======================================================
# 10. أهمية كل متغير
# ======================================================


 


# ======================================================
# 11. مصفوفة الأخطاء
# ======================================================

cm = confusion_matrix(

    y_test,

    prediction

)

print(cm)


# ======================================================
# 12. التقرير الكامل
# ======================================================

print(

    classification_report(

        y_test,

        prediction

    )

)


# ======================================================
# 13. الدقة النهائية
# ======================================================

print(

    "Accuracy:",

    accuracy

)